# Реализуйте функцию grouper(), которая принимает два аргумента в следующем порядке:

#     iterable — итерируемый объект
#     n — натуральное число
# Функция должна возвращать итератор, генерирующий последовательность, элементами которой являются объединенные
# в кортежи по n элементов соседние элементы итерируемого объекта iterable. Если у элемента не достаточно соседей,
# то ими становится значение None.

# Примечание 1. Элементы итерируемого объекта в возвращаемом функцией итераторе должны располагаться в своем исходном порядке.
# Примечание 2. Гарантируется, что итерируемый объект, передаваемый в функцию, не является множеством.


from itertools import zip_longest, repeat


def grouper(iterable, n):
    return zip_longest(*repeat(iter(iterable), n))