# Переменная M1 содержит Numpy матрицу. Произведите операции последовательно:
# 1. Замените значения в предпоследней строке на значения по формуле: sin(x⋅π/6), где x - старое значение
# 2. Замените значения в предпоследнем столбце на значения по формуле: e^x
# Результат запишите в переменную M2.

# Sample Input:
# M1 = np.array((
#     (1., 2., 3., 0.),
#     (4., 5., 6., 0.),
#     (0., 1., 1., 6.),
#     (7., 8., 9., 0.)
# ))

# Sample Output:
# <class 'numpy.ndarray'>
# [[   1.      2.     20.09    0.  ]
#  [   4.      5.    403.43    0.  ]
#  [   0.      0.5     1.65    0.  ]
#  [   7.      8.   8103.08    0.  ]]

import numpy as np

M2 = np.array(M1)
M2[-2, :] = np.sin((np.pi * M2[-2, :])/6)
M2[:, -2] = np.exp(M2[:, -2])