# Дан большой текст, который состоит из нескольких строк, он находится в переменной text.
# Найдите все строки в этой переменной, которые состоят только из символов ^ и $.

# Sample Input 1:
# $$^^$^$$4^^$^^$$$
# ^$^$
# ^$$^$^^^$^^$$^$$$$
# ^^^^$$S^$^$^$^$^^$$

# Sample Output 1:
# ['^$^$', '^$$^$^^^$^^$$^$$$$']

# Sample Input 2:
# ^^^^^$$$$$^$^$$^$^d
# $$$$^$^$$$$^^^$^^^

# Sample Output 2:
# ['$$$$^$^$$$$^^^$^^^']


import re, sys

text = ''.join(sys.stdin.readlines())
print(re.findall(r'(?m)^[\^$]+$', text))