# Добавляем протокол к прокси
# Найдите все прокси, и добавьте к ним в начало протокол http://.

# Sample Input:
# 213.27.152.15:3128 190.93.176.11:8080  37.59.115.136:3128 89.191.131.243:8080 66.96.255.46:45619
# 190.117.115.150:65103 5.45.64.97:3128 154.66.108.70:53281 185.97.122.226:53281

# Sample Output:
# http://213.27.152.15:3128 http://190.93.176.11:8080  http://37.59.115.136:3128 http://89.191.131.243:8080
# http://66.96.255.46:45619 http://190.117.115.150:65103 http://5.45.64.97:3128 http://154.66.108.70:53281
# http://185.97.122.226:53281



import re

processed = re.sub(r'(\d[0-9.:]+\d)', r"http://\1", input())
print(processed)