# Напишите программу, которая разделит строки так же, как в тестовых данных.

# Sample Input 1:
# 3снова+в5 *тексте6спам-.4 : 4 = 32

# Sample Output 1:
# ['3', '+', '5', '*', '6', '-', '4', ':', '4', '=', '32']

# Sample Input 2:
# 45Я всю+жизнь54работал/на9заправке*и2чувствую-когда4надо=помогать людям53

# Sample Output 2:
# ['45', '+', '54', '/', '9', '*', '2', '-', '4', '=', '53']

# Sample Input 3:
# 10spam+again5 =g15

# Sample Output 3:
# ['10', '+', '5', '=', '15']


import re
res = re.split(r'[\.А-яA-z\s]+', input())
print(res)
